Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopySketchGrid Property
 Work Planes cannot be copied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopySketchGrid { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopySketchGrid As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopySketchGrid {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace